cgueble/ESP8266_Door_Status/porte_thingspeaks/build/sketch/build/sketch/build/sketch/build/sketch/build/sketch/build/sketch/build/sketch/porte_thingspeaks.ino.cpp
#include <Arduino.h>
#line 1 "C:\\Users\\cgueble\\Documents\\Arduino\\21-Wifi-porte_thingspeaks-bis\\porte_thingspeaks\\porte_thingspeaks.ino"
#line 1 "C:\\Users\\cgueble\\Documents\\Arduino\\21-Wifi-porte_thingspeaks-bis\\porte_thingspeaks\\porte_thingspeaks.ino"
#include <ESP8266WiFi.h>
#include <WiFiUdp.h>
#include <TimeLib.h>
#include <PubSubClient.h>
#include <Codes_CGU.h>// contient toutes les variables avec les loggins et les codes

//****************Configuration pour Debug****************
const boolean SERIAL_PORT_LOG_ENABLE = true; //true pour avoir la console active et false pour la desactiver ; il faut la desactiver pour l'application car meme pour que "verrou"
const boolean AvecMail = true; //true pour activer les mails

//Declaration des compteurs
int Cpt_Verrou = 0;
int CptTrig = 0;
int CptTrigMax = 20;

//Connexion a Internet
/*const char* ssid0 = "YourSSID_0";//type your ssid
  const char* password0 = "YourPWD_0";//type your password
  const char* ssid1 = "YourSSID_1";//type your ssid
  const char* password1 = "YourPWD_1";//type your password
  const char* ssid2 = "YourSSID_2";//type your ssid
  const char* password2 = "YourPWD_2";//type your password
*/
String CurentSSID;
String CurentSSIDTry;
//Definition des chaines de characteres pour les mails
String MailContent = "no mail content defined\r\n";
String StringDate = "no date";
String StringTime = "no time";

//Definition des Inputs
const int InterphoneSonette = 0; //l'acquisition de la sonette de l'interphone se fera sur GPIO2 c'est a dire D2 c'est a dire la pin 3 de la carte ESP8266-E01 ; c'est une INPUT
const int IlsPorte = 2; //l'acquisition du statut de la porte se fera sur GPIO2 c'est a dire D2 c'est a dire la pin 3 de la carte ESP8266-E01 ; c'est une INPUT
const int Verrou = 3; //l'acquisition du statut du verrou se fera sur GPIO3 c'est a dire D8 c'est a dire la pin 7 de la carte ESP8266-E01 ; c'est une INPUT

//Definition des Outputs
const int InterphonePorte = 1; //la commande de l'interphone se fera sur GPIO1 c'est a dire D7 c'est a dire la pin 2 de la carte ESP8266-E01 ; c'est une OUTPUT

//Variables de gestion de l'etat de la porte et des mails
char server_email[] = "smtp.orange.fr";
const unsigned int localPort = 2390;

boolean Status_IlsPorte = false;
boolean Status_Verrou = false;

boolean Old_Status_IlsPorte = false;
boolean Old_Status_Verrou = true;
boolean Status_Verrou_Change = false;
boolean Status_InterphoneSonette = false;
boolean Status_Ouverture_authorise = false;
boolean TraitementVerrouEnCours = false;                 // true pour iniber la fonction verrou
boolean TraitementInterphoneSonetteEnCours = true;      // true pour iniber la fonction verrou
int MaxDebounse = 8;

boolean statusCheck = false;
String MailToSend = "";
boolean DailyMailSent = true;
boolean DoorClosedBack = true; //true : porte refermee
boolean Update_needed = false;
long rssi; //pour mesure RSSI

//variables pour le gestion de la date et du temps
const char* ntpServerName = "time.nist.gov";
const int NTP_PACKET_SIZE = 48; // NTP time stamp is in the first 48 bytes of the message
byte packetBuffer[ NTP_PACKET_SIZE]; //buffer to hold incoming and outgoing packets
unsigned long secsSince1900 = 0;
const unsigned long seventyYears = 2208988800UL;
int Hour;
int Minute;
int Second;
int Day;
int DayofWeek; // Sunday is day 0
int Month;     // Jan is month 0
int Year;      // the Year minus 1900
int WeekDay;

//Variable pour la gestion de thingspeak
const char* server = "mqtt.thingspeak.com";// Define the ThingSpeak MQTT broker
unsigned long lastConnectionTime = 0; // track the last connection time
const unsigned long postingInterval = 1L * 1000L;// post data every 1 seconds
const unsigned long RegularpostingInterval = 10 * 60 * 1L * 1000L;// post data every 10 min
time_t epoch = 0; // contient
IPAddress ip;
IPAddress timeServerIP;

WiFiClient client;  // Initialize the Wifi client library.
WiFiUDP udp; //A UDP instance to let us send and receive packets over UDP
PubSubClient mqttClient(client); // Initialize the PuBSubClient library

//************************Debut de setup*************************
void setup() {
  if (SERIAL_PORT_LOG_ENABLE) {
    Serial.begin(115200);
    Serial.print("debut de setup. SERIAL_PORT_LOG_ENABLE= ");
    Serial.println(SERIAL_PORT_LOG_ENABLE);
  }
  //Set up PIN in INPUT
  pinMode(InterphoneSonette, INPUT_PULLUP); //LOW : Sonette silentieuse
  pinMode(IlsPorte, INPUT_PULLUP);
  pinMode(Verrou, INPUT_PULLUP);

  //Set up PIN in OUTPUT
  //pinMode(InterphonePorte, OUTPUT);
  //digitalWrite(InterphonePorte, LOW);//CGU test

  if (SERIAL_PORT_LOG_ENABLE) {
    Serial.println(F("InterphoneSonette= 0 (GPIO2), INPUT_PULLUP"));
    Serial.println(F("IlsPorte= 2 (GPIO0), INPUT_PULLUP"));
    Serial.println(F("Verrou= 3 (GPIO3), INPUT_PULLUP"));
    Serial.println(F("Begining of Setup"));
  }

  while ((WiFi.status() != WL_CONNECTED)) {
    WifiConnexionManager();//Recherche reseau wifi + connexion
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.print(".");
      delay(1000);
      Serial.print(".");
      delay(1000);
      Serial.print(".\r");
      delay(1000);
      Serial.println("   \r");
    }
  }//Loop connexion until Wifi Connetion is OK

  if (SERIAL_PORT_LOG_ENABLE) {
    Serial.println("");
    Serial.println("WiFi connected");
    Serial.print("Use this URL to connect: ");
    Serial.print("http://");
    Serial.print(WiFi.localIP());
    Serial.println("/");
  }

  udp.begin(localPort);// Start UDP port for connexion to NTP server

  if (SERIAL_PORT_LOG_ENABLE) {
    Serial.println("Starting UDP");
    Serial.print("Local port: ");
    Serial.println(udp.localPort());
  }

  GetTimeByUDP();
  UpdateTime();
  mqttClient.setServer(server, 1883);// Set the MQTT broker details

  //wifi_status_led_uninstall();

  if (SERIAL_PORT_LOG_ENABLE) {
    Serial.println("End of Setup");
  }
}// fin set up
//******************end of setup*************************************
//*******************************************************************
//******************start of loop************************************
void loop() {

  //LoopLog
  if(SERIAL_PORT_LOG_ENABLE){
  Serial.print(".\r");
  delay(100);
  Serial.print("0\r\n");
  }

  WifiConnectOwner((char*)ssid1,(char*)password1);
  UpdateTime();
  rssi = WiFi.RSSI();
  if (Year < 2016) { // si l'heure n'est pas configuree C est a dire si l'annee n'est pas bonne, alors on recupere l'heure sur le serveur NTP
    GetTimeByUDP();
    UpdateTime();
  }

  if (WiFi.status() != WL_CONNECTED) {// si la connexion WIFI est perdue, alors on relance le setup
    WiFi.disconnect();
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println("Connexion lost ");
    }
    setup();
  }

