cgueble/ESP8266_Door_Status/porte_thingspeaks/build/sketch/build/sketch/build/sketch/build/sketch/build/sketch/build/sketch/build/sketch/porte_thingspeaks.ino.cpp
      }
      break;
    }
  }//End FOR
Serial.println("End of WifiConnectOwner");  
}//end WifiConnectOwner

void WaitConnexion(){
      int cpt=10;
      if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println("Begin of WaitConnexion");
      Serial.print("cpt= ");
      Serial.print(cpt);
      Serial.print("   WiFi.status= ");
      Serial.print(WiFi.status());
      Serial.print("   WL_CONNECTED= ");
      Serial.println(WL_CONNECTED);
      Serial.print("test = (cpt >= 0) && ((WiFi.status() != WL_CONNECTED)) =  ");
      Serial.println((cpt > 0) && ((WiFi.status() != WL_CONNECTED)));
      }
      while((cpt > 0) && ((WiFi.status() != WL_CONNECTED))){
      if (SERIAL_PORT_LOG_ENABLE) {
      Serial.print("cpt= ");
      Serial.print(cpt);
      Serial.print("   WiFi.status= ");
      Serial.print(WiFi.status());
      Serial.print("   WL_CONNECTED= ");
      Serial.println(WL_CONNECTED);
      Serial.print("test = (cpt >= 0) && ((WiFi.status() != WL_CONNECTED)) =  ");
      Serial.println((cpt > 0) && ((WiFi.status() != WL_CONNECTED)));
      }
      cpt = cpt -1;
      delay(1000);
      }
      if (SERIAL_PORT_LOG_ENABLE) {
      Serial.print("cpt= ");
      Serial.print(cpt);
      Serial.print("   WiFi.status= ");
      Serial.print(WiFi.status());
      Serial.print("   WL_CONNECTED= ");
      Serial.println(WL_CONNECTED);
      Serial.print("test = (cpt >= 0) && ((WiFi.status() != WL_CONNECTED)) =  ");
      Serial.println((cpt > 0) && ((WiFi.status() != WL_CONNECTED)));
      }
      if ((WiFi.status()== WL_CONNECTED))
      {
          if (SERIAL_PORT_LOG_ENABLE) {
             Serial.print("connecte a: ");
             Serial.println(WiFi.SSID());
            }
      } 
      if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println("End of WaitConnexion");  
      }   
}// end Waitconnexion



